{"meta":{"title":"donnic","subtitle":null,"description":null,"author":"donnic","url":"http://blog.dotnic.top"},"pages":[],"posts":[{"title":"人类的未来","slug":"future","date":"2017-05-27T11:41:58.000Z","updated":"2017-07-18T10:42:38.233Z","comments":true,"path":"2017/05/27/future/","link":"","permalink":"http://blog.dotnic.top/2017/05/27/future/","excerpt":"记得小学四年级时候曾和隔壁家小孩一起在上学的路上讨论过这样一个话题： 南极融化后海平面会上升多少。 我当时认为 海水会淹没到膝盖这个地方，而他却坚持认为海平面会升到腰部附近 并向我进一步解释了海拔高度的变化。我因为不清楚海拔、海平面这些个高大上的名词 所以非常虚心的接受了隔壁小朋友的观点。。。","text":"记得小学四年级时候曾和隔壁家小孩一起在上学的路上讨论过这样一个话题： 南极融化后海平面会上升多少。 我当时认为 海水会淹没到膝盖这个地方，而他却坚持认为海平面会升到腰部附近 并向我进一步解释了海拔高度的变化。我因为不清楚海拔、海平面这些个高大上的名词 所以非常虚心的接受了隔壁小朋友的观点。。。现如今每次看到微博或朋友圈里有人工智能方面的相关预测和讨论就不由得想起上面的情形。 我认为机器虽然在不断进步但永远不会有能像人类一样思考的机器诞生的。 不，我认为机器早晚会取代或统治人类的 你如果这样想就大错特错了。。。 这般的讨论简直和小学四年级的孩子一样，而且从二战结束计算机第一次被研发出来后 这样的讨论就从没停止过 但在这些毫无根据非常独断自我的讨论中 图灵给出了判断机器是否拥有人类思维的方法——图灵测试 如此简洁 和具有说服力。感觉这才是有效的讨论和预测。但在那个没有网络 没有实现想法的设备 没有可以讨论的学术环境，他的任何机器智能相关的深入研究都会显得孤独无助，以至于他在生命的最后几年转向了生物化学的研究。虽然他在计算科学方面的研究影响深远，是通往机器智能的基础。但除此之外得以流传至今的智能相关的理论貌似也只有图灵测试。 结合以上内容，我虽然认为不能在一知半解的情况下 擅自判断妄加预测。但至少一点是肯定的：各个行业即使没有人工智能的冲击 也依然在不断的进行着简单劳动逐渐被机器替代的过程，无法判断未来工作岗位是否会大量减少 但普通人的工作种类必然会越来越少。那么 越来越少的极限是什么，什么样的简单工作很难被机器取代呢？其实写以上这么多话都是为了 给下面做铺垫的 摒弃了各种无端猜测 在机器越来越智能的未来 真正不能被替代的简单工作是什么呢 我猜大概是 真人秀 吧。 因为机器再怎么智能 他也不是真人啊。 就像人类凭现在的技术足以 搞出各种可爱的虚拟人物 虚拟动物但你还是会去点开 各种猫咪 各种熊猫的视频看吧。在先进技术的冲击下 即便动物园的工人会被取代但动物园的动物不可能被机器取代的，动物园也不会在未来消失（大概）。 在一个人工智能高度发达的未来 那些坐拥数家无人工厂 整日被各种机器人服侍的上层人类会不会 在一个无聊的下午突然想看看那些已经没有工作 不会多门外语 不懂经济 不知艺术 的普通人 他们的生活是怎样的呢 会不会突发奇想 出钱找一些没有工作的普通人 聚在一个地方 上演一场没有高科技的旧时代下的真人秀。 会不会有人意识到了这种需求 而搭建了相关的平台 成立了相关的公司。。。 写到这我突然想到了 西部世界，也许那就是一种可能的未来 但公司里的演员不是机器人 而是真正的普通人和出钱体验的游客。","categories":[{"name":"diary","slug":"diary","permalink":"http://blog.dotnic.top/categories/diary/"}],"tags":[]},{"title":"第一篇博客就写一下博客建立的流程吧","slug":"hello-my-blog","date":"2017-05-16T11:34:08.000Z","updated":"2017-07-17T06:45:56.836Z","comments":true,"path":"2017/05/16/hello-my-blog/","link":"","permalink":"http://blog.dotnic.top/2017/05/16/hello-my-blog/","excerpt":"列举了如下 技能点 node.js git gitHub github pages hexo markdown 个人域名 七牛云 第三方评论平台 第三方统计平台","text":"列举了如下 技能点 node.js git gitHub github pages hexo markdown 个人域名 七牛云 第三方评论平台 第三方统计平台 分割线之前的 是搭建个人免费博客所必备的之后的 是对个人博客的完善 是accessory 然后是两个chrome插件介绍 极简图床 markdown reader 分别可以简化上传七牛云图片的步骤 和 方便markdown 的编写 不得不说 搭建hexo博客以来的最大收获就是 学会使用markdown 虽然很早之前就尝试过markdown，一直不以为然，如今真正熟悉使用之后才能感受到它的魅力 搭建过程有感相信任何一个零基础的人也能按照上面的名词百度出相关教程和文档 独立实现。但因为对未知的恐慌 对于零基础的新手来说这其间消耗的时间可能会很长所以我并不认为 网上那些零基础教你七八个小时搭建hexo博客的教程 真的能让你在指定时间内实现你想要的。 作为一个程序员 我也花了大概6个小时，断断续续的整了三天并没觉得有多困难 只是因为对hexo的陌生感 而在主题选择、尝试和修改等问题上消耗太多时间hexo的英文文档快看完了才猛然发现官方提供有中文文档。原来hexo本来就是台湾的一个家伙做出来的。虽然我有自信帮助身边的同事两个小时内掌握在GitHub上搭建博客的方法，但我并不认为能够写出比网上已有教程更好的说明。 所以在此仅列出我认为不错的hexo搭建教程的 链接 参考 使用Hexo搭建个人博客(基于hexo3.0) 从零开始定制hexo主题 说明不少教程都有些过时，上面的hexo3.0的教程 还算可以主题定制虽然是零基础 但教你做主题的文章并不多 总结以上内容都是我刚接触hexo时所写，等日后把这个玩6了，有时间再写一份搭建博客和主题定制的深入教程吧","categories":[{"name":"hexo","slug":"hexo","permalink":"http://blog.dotnic.top/categories/hexo/"}],"tags":[]}]}